---
kind: property
id: P:Autodesk.Revit.DB.Architecture.TopographySurface.ArePointsEditable
source: html/5f106a73-01ff-9460-fb7a-58033451dded.htm
---
# Autodesk.Revit.DB.Architecture.TopographySurface.ArePointsEditable Property

Identifies whether the points of this topography surface can be edited independently.
 Topography surfaces created from external data will not allow editing of individual points.

## Syntax (C#)
```csharp
public bool ArePointsEditable { get; }
```